# ETL

## Specifications:

- Create a MySQL database for stakeholder.

- Normalize the tables as best you can before adding them to new database.

Note: an important exception to stakeholder's request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).  
- Need to keep the imdb_id, revenue, budget, and certification columns

Normalize Genre:

Convert the single string of genres from title basics into 2 new tables.

- title_genres: with the columns:

  - tconst
  - genre_id
- genres:

  - genre_id
  - genre_name

In [15]:
#import libraries 

import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns
import json
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

## Title basics data

In [2]:
#load basics data first 

basics = pd.read_csv('Data/title_basics.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller"

In [3]:
#create a column with a list of genres

basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...,...,...,...,...
79320,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
79321,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
79322,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
79323,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
79324,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [4]:
#separate list of genres into new rows

exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
79323,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Action
79323,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Adventure
79323,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Thriller
79324,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
79324,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [5]:
#display unique genres

unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [6]:
#save tconst and genres_split as a new dataframe

title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [7]:
#make a genre mapper dictionary

genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [8]:
#make genre_id and drop string genres

title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [9]:
#manually make dataframe with named cols from the .keyd and .values
genre_dict = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})
genre_dict.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [10]:
#sql creds

with open('/Users/alicia/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [11]:
# Create connection string 

connection_str = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/Movies"
engine = create_engine(connection_str)

In [13]:
# Create Movies database, if it does not already exist

if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

In [14]:
#drop unnecessary columns

basics = basics.drop(columns = ['titleType', 'originalTitle',
                                'isAdult', 'endYear', 'genres', 'genres_split'])
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79325 entries, 0 to 79324
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          79325 non-null  object
 1   primaryTitle    79325 non-null  object
 2   startYear       79325 non-null  int64
 3   runtimeMinutes  79325 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.4+ MB

In [16]:
# Calculate max string lengths for object columns

key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

# Create a schema dictonary using Sqlalchemy datatype objects

df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [17]:
#save the sql with dtype and index=False

basics.to_sql('title_basics', engine, dtype=df_schema,
                 if_exists = 'replace', index=False)

In [18]:
#update the table and column with sqlalchemy

engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

## Title Ratings Data

In [24]:
#load ratings data first 

ratings = pd.read_csv('Data/title_ratings.csv.gz')
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1884
1  tt0000002            5.9       250
2  tt0000003            6.5      1669
3  tt0000004            5.8       163
4  tt0000005            6.2      2491

In [25]:
## Calculate max string lengths for object columns

key_len = ratings['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects

df_schema = {
    "tconst": String(key_len+1), 
    'averageRating': Float(),
    'numVotes': Integer()}

In [26]:
#save to sql with dtype and index=False

ratings.to_sql('title_ratings', engine, dtype=df_schema,
                      if_exists = 'replace', index=False)

In [27]:
# Use the sqlalchemy engine to update the table and set tconst as the primary key

engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

## Title Genres

In [28]:
## Calculate max string lengths for object columns

key_len = title_genres['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects

df_schema = {
    "tconst": String(key_len+1), 
    'genre_id': Integer()}

In [29]:
#save to sql with dtype and index=false

title_genres.to_sql('title_genres', engine, dtype=df_schema, 
                   if_exists = 'replace', index=False)

## Genres

In [30]:
## Calculate max string lengths for object columns

key_len = genre_dict['genre_name'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects

df_schema = {
    "genre_name": String(key_len+1), 
    'genre_id': Integer()}

In [31]:
#save to sql with dtype and index=false

genre_dict.to_sql('genres', engine, dtype=df_schema,
                   if_exists = 'replace', index=False)

In [32]:
# Use the sqlalchemy engine to update the table and set genre_id as the primary key

engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

## TMDB

In [59]:
#load both datas and combine

tmdb_df_2000 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz')
tmdb_df_2001 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz')
display(tmdb_df_2000.head(2), tmdb_df_2001.head(2))

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0035423,0.0,/ab5yL8zgRotrICzGbEl10z24N71.jpg,NaN,48000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 14, 'nam...",NaN,11232.0,en,Kate & Leopold,...,76019048.0,118.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,If they lived in the same century they'd be pe...,Kate & Leopold,0.0,6.3,1117.0,PG-13

In [60]:
#no year column, so to differentiate lets put one in

tmdb_df_2000['year'] = 2000
tmdb_df_2001['year'] = 2001

In [61]:
tmdb_df = pd.concat([tmdb_df_2000, tmdb_df_2001], axis=0)
tmdb_df.head(2)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification,year
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2000
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN,2000

In [62]:
#grab dataframe with only values greater than 0 in budget and revenue

tmdb_df_finan = df[(df['budget'] > 0) & (df['revenue'] > 0)]
tmdb_df_finan.head(2)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification,year
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,1887.0,PG,2000
11,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.4,42.0,R,2000

In [63]:
tmdb_df = tmdb_df_finan.drop(columns = ['adult', 'backdrop_path','belongs_to_collection',
                               'genres', 'homepage', 'id', 'original_language', 
                              'original_title', 'overview', 'popularity', 
                              'poster_path', 'production_companies',
                               'production_countries', 'release_date', 
                              'runtime', 'spoken_languages', 'status', 
                              'tagline', 'title', 'video', 'vote_average', 
                              'vote_count', 'year'])
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 346 entries, 4 to 1238
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        346 non-null    object
 1   budget         346 non-null    float64
 2   revenue        346 non-null    float64
 3   certification  303 non-null    object
dtypes: float64(2), object(2)
memory usage: 13.5+ KB

In [64]:
# Calculate max string lengths for object columns ('tconst' and 'primaryTitle')

imdb_id_len = tmdb_df['imdb_id'].fillna('').map(len).max()

certification_len = tmdb_df['certification'].fillna('').map(len).max()

# Create a schema dictonary using Sqlalchemy datatype objects

df_schema = {
    'imdb_id': String(imdb_id_len+1), 
    'budget':Float(), 
    'revenue':Float(),
    'certification': String(certification_len+1)}

In [65]:
tmdb_df.to_sql('tmdb_data', engine, dtype=df_schema, 
              if_exists='replace', index=False)

In [66]:
# Use the sqlalchemy engine to update the table and set imdb_id as the primary key

engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

## SQL tables

In [67]:
# Run show tables query
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

In [68]:
#genres
q = """
SELECT * 
FROM genres LIMIT 3
;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2

In [69]:
q = """
SELECT * 
FROM title_basics LIMIT 3
;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122

In [70]:
q = """
SELECT * 
FROM title_genres LIMIT 3
;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18

In [71]:
q = """
SELECT * 
FROM title_ratings LIMIT 3
;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1884
1  tt0000002            5.9       250
2  tt0000003            6.5      1669

In [72]:
q = """
SELECT * 
FROM tmdb_data LIMIT 3
;"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0118589  22000000.0   5271670.0         PG-13
2  tt0118694    150000.0  12855000.0            PG